"%@ - Offline" = "%@- Offline";

"3D Secure" = "3D Secure";

"Add New Card…" = "Żid Kard Ġdida…";

"Add a Card" = "Żid Kard";

"Apt." = "Appartament";

"Contact" = "Kuntatt";

"Delivery" = "Kunsinna";

"Delivery Address" = "Indirizz tal-Kunsinna";

"Free" = "Bla ħlas";

"Invalid Shipping Address" = "L-Indirizz għat-Trasport tal-Merkanzija Mhux Validu";

"Loading…" = "Qed jillowdja…";

"Multibanco" = "Multibanco";

"Next" = "Li jmiss";

"Online Banking (FPX)" = "Bankar online";

"Payment Method" = "Metodu tal-Ħlas";

"Shipping" = "Trasport tal-Merkanzija";

"Shipping Method" = "Il-Mod tat-Trasport tal-Merkanzija";

"Use Billing" = "Uża tal-Kont";

"Use Delivery" = "Uża tal-Kunsinna";

"Use Shipping" = "Uża tat-Trasport tal-Merkanzija";
